RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g_features.h
#define TIM_ADV_EGR_CC5G_SHIFT                     TIM1_EGR_CC5G_SHIFT
#define TIM_ADV_EGR_CC5G_MASK                      TIM1_EGR_CC5G_MASK
#define TIM_ADV_EGR_CC5G(x)                        TIM1_EGR_CC5G(x)

#define TIM_ADV_EGR_BG_SHIFT                       TIM1_EGR_BG_SHIFT
#define TIM_ADV_EGR_BG_MASK                        TIM1_EGR_BG_MASK
#define TIM_ADV_EGR_BG(x)                          TIM1_EGR_BG(x)

#define TIM_ADV_EGR_TG_SHIFT                       TIM1_EGR_TG_SHIFT
#define TIM_ADV_EGR_TG_MASK                        TIM1_EGR_TG_MASK
#define TIM_ADV_EGR_TG(x)                          TIM1_EGR_TG(x)

#define TIM_ADV_EGR_COMG_SHIFT                     TIM1_EGR_COMG_SHIFT
#define TIM_ADV_EGR_COMG_MASK                      TIM1_EGR_COMG_MASK
#define TIM_ADV_EGR_COMG(x)                        TIM1_EGR_COMG(x)

#define TIM_ADV_EGR_CC4G_SHIFT                     TIM1_EGR_CC4G_SHIFT
#define TIM_ADV_EGR_CC4G_MASK                      TIM1_EGR_CC4G_MASK
#define TIM_ADV_EGR_CC4G(x)                        TIM1_EGR_CC4G(x)

#define TIM_ADV_EGR_CC3G_SHIFT                     TIM1_EGR_CC3G_SHIFT
#define TIM_ADV_EGR_CC3G_MASK                      TIM1_EGR_CC3G_MASK
#define TIM_ADV_EGR_CC3G(x)                        TIM1_EGR_CC3G(x)

#define TIM_ADV_EGR_CC2G_SHIFT                     TIM1_EGR_CC2G_SHIFT
#define TIM_ADV_EGR_CC2G_MASK                      TIM1_EGR_CC2G_MASK
#define TIM_ADV_EGR_CC2G(x)                        TIM1_EGR_CC2G(x)

#define TIM_ADV_EGR_CC1G_SHIFT                     TIM1_EGR_CC1G_SHIFT
#define TIM_ADV_EGR_CC1G_MASK                      TIM1_EGR_CC1G_MASK
#define TIM_ADV_EGR_CC1G(x)                        TIM1_EGR_CC1G(x)

#define TIM_ADV_EGR_UG_SHIFT                       TIM1_EGR_UG_SHIFT
#define TIM_ADV_EGR_UG_MASK                        TIM1_EGR_UG_MASK
#define TIM_ADV_EGR_UG(x)                          TIM1_EGR_UG(x)

/*!
 * @brief TIM_ADV_CCMR1 Register Bit Definition
 */

#define TIM_ADV_CCMR1_OC2CE_SHIFT                  TIM1_CCMR1_OC2CE_SHIFT
#define TIM_ADV_CCMR1_OC2CE_MASK                   TIM1_CCMR1_OC2CE_MASK
#define TIM_ADV_CCMR1_OC2CE(x)                     TIM1_CCMR1_OC2CE(x)

#define TIM_ADV_CCMR1_OC2M_SHIFT                   TIM1_CCMR1_OC2M_SHIFT
#define TIM_ADV_CCMR1_OC2M_MASK                    TIM1_CCMR1_OC2M_MASK
#define TIM_ADV_CCMR1_OC2M(x)                      TIM1_CCMR1_OC2M(x)

#define TIM_ADV_CCMR1_OC2PE_SHIFT                  TIM1_CCMR1_OC2PE_SHIFT
#define TIM_ADV_CCMR1_OC2PE_MASK                   TIM1_CCMR1_OC2PE_MASK
#define TIM_ADV_CCMR1_OC2PE(x)                     TIM1_CCMR1_OC2PE(x)

#define TIM_ADV_CCMR1_OC2FE_SHIFT                  TIM1_CCMR1_OC2FE_SHIFT
#define TIM_ADV_CCMR1_OC2FE_MASK                   TIM1_CCMR1_OC2FE_MASK
#define TIM_ADV_CCMR1_OC2FE(x)                     TIM1_CCMR1_OC2FE(x)

#define TIM_ADV_CCMR1_CC2S_SHIFT                   TIM1_CCMR1_CC2S_SHIFT
#define TIM_ADV_CCMR1_CC2S_MASK                    TIM1_CCMR1_CC2S_MASK
#define TIM_ADV_CCMR1_CC2S(x)                      TIM1_CCMR1_CC2S(x)

#define TIM_ADV_CCMR1_OC1CE_SHIFT                  TIM1_CCMR1_OC1CE_SHIFT
#define TIM_ADV_CCMR1_OC1CE_MASK                   TIM1_CCMR1_OC1CE_MASK
#define TIM_ADV_CCMR1_OC1CE(x)                     TIM1_CCMR1_OC1CE(x)

#define TIM_ADV_CCMR1_OC1M_SHIFT                   TIM1_CCMR1_OC1M_SHIFT
#define TIM_ADV_CCMR1_OC1M_MASK                    TIM1_CCMR1_OC1M_MASK
#define TIM_ADV_CCMR1_OC1M(x)                      TIM1_CCMR1_OC1M(x)

#define TIM_ADV_CCMR1_OC1PE_SHIFT                  TIM1_CCMR1_OC1PE_SHIFT
#define TIM_ADV_CCMR1_OC1PE_MASK                   TIM1_CCMR1_OC1PE_MASK
#define TIM_ADV_CCMR1_OC1PE(x)                     TIM1_CCMR1_OC1PE(x)

#define TIM_ADV_CCMR1_OC1FE_SHIFT                  TIM1_CCMR1_OC1FE_SHIFT
#define TIM_ADV_CCMR1_OC1FE_MASK                   TIM1_CCMR1_OC1FE_MASK
#define TIM_ADV_CCMR1_OC1FE(x)                     TIM1_CCMR1_OC1FE(x)

#define TIM_ADV_CCMR1_CC1S_SHIFT                   TIM1_CCMR1_CC1S_SHIFT
#define TIM_ADV_CCMR1_CC1S_MASK                    TIM1_CCMR1_CC1S_MASK
#define TIM_ADV_CCMR1_CC1S(x)                      TIM1_CCMR1_CC1S(x)

/*!
 * @brief TIM_ADV_CCMR1 Register Bit Definition
 */

#define TIM_ADV_CCMR1_IC2F_SHIFT                   TIM1_CCMR1_IC2F_SHIFT
#define TIM_ADV_CCMR1_IC2F_MASK                    TIM1_CCMR1_IC2F_MASK
#define TIM_ADV_CCMR1_IC2F(x)                      TIM1_CCMR1_IC2F(x)

#define TIM_ADV_CCMR1_IC2PSC_SHIFT                 TIM1_CCMR1_IC2PSC_SHIFT
#define TIM_ADV_CCMR1_IC2PSC_MASK                  TIM1_CCMR1_IC2PSC_MASK
#define TIM_ADV_CCMR1_IC2PSC(x)                    TIM1_CCMR1_IC2PSC(x)

#define TIM_ADV_CCMR1_CC2S_SHIFT                   TIM1_CCMR1_CC2S_SHIFT
#define TIM_ADV_CCMR1_CC2S_MASK                    TIM1_CCMR1_CC2S_MASK
#define TIM_ADV_CCMR1_CC2S(x)                      TIM1_CCMR1_CC2S(x)

#define TIM_ADV_CCMR1_IC1F_SHIFT                   TIM1_CCMR1_IC1F_SHIFT
#define TIM_ADV_CCMR1_IC1F_MASK                    TIM1_CCMR1_IC1F_MASK
#define TIM_ADV_CCMR1_IC1F(x)                      TIM1_CCMR1_IC1F(x)

#define TIM_ADV_CCMR1_IC1PSC_SHIFT                 TIM1_CCMR1_IC1PSC_SHIFT
#define TIM_ADV_CCMR1_IC1PSC_MASK                  TIM1_CCMR1_IC1PSC_MASK
#define TIM_ADV_CCMR1_IC1PSC(x)                    TIM1_CCMR1_IC1PSC(x)

#define TIM_ADV_CCMR1_CC1S_SHIFT                   TIM1_CCMR1_CC1S_SHIFT
#define TIM_ADV_CCMR1_CC1S_MASK                    TIM1_CCMR1_CC1S_MASK
#define TIM_ADV_CCMR1_CC1S(x)                      TIM1_CCMR1_CC1S(x)

/*!
 * @brief TIM_ADV_CCMR2 Register Bit Definition
 */

#define TIM_ADV_CCMR2_OC4CE_SHIFT                  TIM1_CCMR2_OC4CE_SHIFT
#define TIM_ADV_CCMR2_OC4CE_MASK                   TIM1_CCMR2_OC4CE_MASK
#define TIM_ADV_CCMR2_OC4CE(x)                     TIM1_CCMR2_OC4CE(x)

#define TIM_ADV_CCMR2_OC4M_SHIFT                   TIM1_CCMR2_OC4M_SHIFT
#define TIM_ADV_CCMR2_OC4M_MASK                    TIM1_CCMR2_OC4M_MASK
#define TIM_ADV_CCMR2_OC4M(x)                      TIM1_CCMR2_OC4M(x)

#define TIM_ADV_CCMR2_OC4PE_SHIFT                  TIM1_CCMR2_OC4PE_SHIFT
#define TIM_ADV_CCMR2_OC4PE_MASK                   TIM1_CCMR2_OC4PE_MASK
#define TIM_ADV_CCMR2_OC4PE(x)                     TIM1_CCMR2_OC4PE(x)

