RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g_features.h
#define TIM_ADV_PDER_CCR1SHIFTEN_SHIFT             TIM1_PDER_CCR1SHIFTEN_SHIFT
#define TIM_ADV_PDER_CCR1SHIFTEN_MASK              TIM1_PDER_CCR1SHIFTEN_MASK
#define TIM_ADV_PDER_CCR1SHIFTEN(x)                TIM1_PDER_CCR1SHIFTEN(x)

#define TIM_ADV_PDER_CCDREPE_SHIFT                 TIM1_PDER_CCDREPE_SHIFT
#define TIM_ADV_PDER_CCDREPE_MASK                  TIM1_PDER_CCDREPE_MASK
#define TIM_ADV_PDER_CCDREPE(x)                    TIM1_PDER_CCDREPE(x)

/*!
 * @brief TIM_ADV_CCRFALL Register Bit Definition
 */

#define TIM_ADV_CCRFALL_CCRXFALL_SHIFT             TIM1_CCRFALL_CCRXFALL_SHIFT
#define TIM_ADV_CCRFALL_CCRXFALL_MASK              TIM1_CCRFALL_CCRXFALL_MASK
#define TIM_ADV_CCRFALL_CCRXFALL(x)                TIM1_CCRFALL_CCRXFALL(x)

/*!
 * @}
 */ /* end of group TIM_ADV_Register_Masks */

/*******************************************************************************
 * TIM_16B Type
 ******************************************************************************/

/*!
 * @addtogroup TIM_16B_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM_16B_CR1 Register Bit Definition
 */

#define TIM_16B_CR1_CKD_SHIFT                      TIM3_CR1_CKD_SHIFT
#define TIM_16B_CR1_CKD_MASK                       TIM3_CR1_CKD_MASK
#define TIM_16B_CR1_CKD(x)                         TIM3_CR1_CKD(x)

#define TIM_16B_CR1_APRE_SHIFT                     TIM3_CR1_APRE_SHIFT
#define TIM_16B_CR1_APRE_MASK                      TIM3_CR1_APRE_MASK
#define TIM_16B_CR1_APRE(x)                        TIM3_CR1_APRE(x)

#define TIM_16B_CR1_CMS_SHIFT                      TIM3_CR1_CMS_SHIFT
#define TIM_16B_CR1_CMS_MASK                       TIM3_CR1_CMS_MASK
#define TIM_16B_CR1_CMS(x)                         TIM3_CR1_CMS(x)

#define TIM_16B_CR1_DIR_SHIFT                      TIM3_CR1_DIR_SHIFT
#define TIM_16B_CR1_DIR_MASK                       TIM3_CR1_DIR_MASK
#define TIM_16B_CR1_DIR(x)                         TIM3_CR1_DIR(x)

#define TIM_16B_CR1_OPM_SHIFT                      TIM3_CR1_OPM_SHIFT
#define TIM_16B_CR1_OPM_MASK                       TIM3_CR1_OPM_MASK
#define TIM_16B_CR1_OPM(x)                         TIM3_CR1_OPM(x)

#define TIM_16B_CR1_URS_SHIFT                      TIM3_CR1_URS_SHIFT
#define TIM_16B_CR1_URS_MASK                       TIM3_CR1_URS_MASK
#define TIM_16B_CR1_URS(x)                         TIM3_CR1_URS(x)

#define TIM_16B_CR1_UDIS_SHIFT                     TIM3_CR1_UDIS_SHIFT
#define TIM_16B_CR1_UDIS_MASK                      TIM3_CR1_UDIS_MASK
#define TIM_16B_CR1_UDIS(x)                        TIM3_CR1_UDIS(x)

#define TIM_16B_CR1_CEN_SHIFT                      TIM3_CR1_CEN_SHIFT
#define TIM_16B_CR1_CEN_MASK                       TIM3_CR1_CEN_MASK
#define TIM_16B_CR1_CEN(x)                         TIM3_CR1_CEN(x)

/*!
 * @brief TIM_16B_CR2 Register Bit Definition
 */

#define TIM_16B_CR2_TI1S_SHIFT                     TIM3_CR2_TI1S_SHIFT
#define TIM_16B_CR2_TI1S_MASK                      TIM3_CR2_TI1S_MASK
#define TIM_16B_CR2_TI1S(x)                        TIM3_CR2_TI1S(x)

#define TIM_16B_CR2_MMS_SHIFT                      TIM3_CR2_MMS_SHIFT
#define TIM_16B_CR2_MMS_MASK                       TIM3_CR2_MMS_MASK
#define TIM_16B_CR2_MMS(x)                         TIM3_CR2_MMS(x)

#define TIM_16B_CR2_CCDS_SHIFT                     TIM3_CR2_CCDS_SHIFT
#define TIM_16B_CR2_CCDS_MASK                      TIM3_CR2_CCDS_MASK
#define TIM_16B_CR2_CCDS(x)                        TIM3_CR2_CCDS(x)

/*!
 * @brief TIM_16B_SMCR Register Bit Definition
 */

#define TIM_16B_SMCR_ETP_SHIFT                     TIM3_SMCR_ETP_SHIFT
#define TIM_16B_SMCR_ETP_MASK                      TIM3_SMCR_ETP_MASK
#define TIM_16B_SMCR_ETP(x)                        TIM3_SMCR_ETP(x)

#define TIM_16B_SMCR_ECE_SHIFT                     TIM3_SMCR_ECE_SHIFT
#define TIM_16B_SMCR_ECE_MASK                      TIM3_SMCR_ECE_MASK
#define TIM_16B_SMCR_ECE(x)                        TIM3_SMCR_ECE(x)

#define TIM_16B_SMCR_ETPS_SHIFT                    TIM3_SMCR_ETPS_SHIFT
#define TIM_16B_SMCR_ETPS_MASK                     TIM3_SMCR_ETPS_MASK
#define TIM_16B_SMCR_ETPS(x)                       TIM3_SMCR_ETPS(x)

#define TIM_16B_SMCR_ETF_SHIFT                     TIM3_SMCR_ETF_SHIFT
#define TIM_16B_SMCR_ETF_MASK                      TIM3_SMCR_ETF_MASK
#define TIM_16B_SMCR_ETF(x)                        TIM3_SMCR_ETF(x)

#define TIM_16B_SMCR_MSM_SHIFT                     TIM3_SMCR_MSM_SHIFT
#define TIM_16B_SMCR_MSM_MASK                      TIM3_SMCR_MSM_MASK
#define TIM_16B_SMCR_MSM(x)                        TIM3_SMCR_MSM(x)

#define TIM_16B_SMCR_TS_SHIFT                      TIM3_SMCR_TS_SHIFT
#define TIM_16B_SMCR_TS_MASK                       TIM3_SMCR_TS_MASK
#define TIM_16B_SMCR_TS(x)                         TIM3_SMCR_TS(x)

#define TIM_16B_SMCR_OCCS_SHIFT                    TIM3_SMCR_OCCS_SHIFT
#define TIM_16B_SMCR_OCCS_MASK                     TIM3_SMCR_OCCS_MASK
#define TIM_16B_SMCR_OCCS(x)                       TIM3_SMCR_OCCS(x)

#define TIM_16B_SMCR_SMS_SHIFT                     TIM3_SMCR_SMS_SHIFT
#define TIM_16B_SMCR_SMS_MASK                      TIM3_SMCR_SMS_MASK
#define TIM_16B_SMCR_SMS(x)                        TIM3_SMCR_SMS(x)

/*!
 * @brief TIM_16B_DIER Register Bit Definition
 */

#define TIM_16B_DIER_TDE_SHIFT                     TIM3_DIER_TDE_SHIFT
#define TIM_16B_DIER_TDE_MASK                      TIM3_DIER_TDE_MASK
#define TIM_16B_DIER_TDE(x)                        TIM3_DIER_TDE(x)

#define TIM_16B_DIER_CC4DE_SHIFT                   TIM3_DIER_CC4DE_SHIFT
#define TIM_16B_DIER_CC4DE_MASK                    TIM3_DIER_CC4DE_MASK
#define TIM_16B_DIER_CC4DE(x)                      TIM3_DIER_CC4DE(x)

#define TIM_16B_DIER_CC3DE_SHIFT                   TIM3_DIER_CC3DE_SHIFT
#define TIM_16B_DIER_CC3DE_MASK                    TIM3_DIER_CC3DE_MASK
#define TIM_16B_DIER_CC3DE(x)                      TIM3_DIER_CC3DE(x)

#define TIM_16B_DIER_CC2DE_SHIFT                   TIM3_DIER_CC2DE_SHIFT
#define TIM_16B_DIER_CC2DE_MASK                    TIM3_DIER_CC2DE_MASK
#define TIM_16B_DIER_CC2DE(x)                      TIM3_DIER_CC2DE(x)

