RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g_features.h
#define TIM_16B_DIER_CC1DE_SHIFT                   TIM3_DIER_CC1DE_SHIFT
#define TIM_16B_DIER_CC1DE_MASK                    TIM3_DIER_CC1DE_MASK
#define TIM_16B_DIER_CC1DE(x)                      TIM3_DIER_CC1DE(x)

#define TIM_16B_DIER_UDE_SHIFT                     TIM3_DIER_UDE_SHIFT
#define TIM_16B_DIER_UDE_MASK                      TIM3_DIER_UDE_MASK
#define TIM_16B_DIER_UDE(x)                        TIM3_DIER_UDE(x)

#define TIM_16B_DIER_TIE_SHIFT                     TIM3_DIER_TIE_SHIFT
#define TIM_16B_DIER_TIE_MASK                      TIM3_DIER_TIE_MASK
#define TIM_16B_DIER_TIE(x)                        TIM3_DIER_TIE(x)

#define TIM_16B_DIER_CC4IE_SHIFT                   TIM3_DIER_CC4IE_SHIFT
#define TIM_16B_DIER_CC4IE_MASK                    TIM3_DIER_CC4IE_MASK
#define TIM_16B_DIER_CC4IE(x)                      TIM3_DIER_CC4IE(x)

#define TIM_16B_DIER_CC3IE_SHIFT                   TIM3_DIER_CC3IE_SHIFT
#define TIM_16B_DIER_CC3IE_MASK                    TIM3_DIER_CC3IE_MASK
#define TIM_16B_DIER_CC3IE(x)                      TIM3_DIER_CC3IE(x)

#define TIM_16B_DIER_CC2IE_SHIFT                   TIM3_DIER_CC2IE_SHIFT
#define TIM_16B_DIER_CC2IE_MASK                    TIM3_DIER_CC2IE_MASK
#define TIM_16B_DIER_CC2IE(x)                      TIM3_DIER_CC2IE(x)

#define TIM_16B_DIER_CC1IE_SHIFT                   TIM3_DIER_CC1IE_SHIFT
#define TIM_16B_DIER_CC1IE_MASK                    TIM3_DIER_CC1IE_MASK
#define TIM_16B_DIER_CC1IE(x)                      TIM3_DIER_CC1IE(x)

#define TIM_16B_DIER_UIE_SHIFT                     TIM3_DIER_UIE_SHIFT
#define TIM_16B_DIER_UIE_MASK                      TIM3_DIER_UIE_MASK
#define TIM_16B_DIER_UIE(x)                        TIM3_DIER_UIE(x)

/*!
 * @brief TIM_16B_SR Register Bit Definition
 */

#define TIM_16B_SR_CC4OF_SHIFT                     TIM3_SR_CC4OF_SHIFT
#define TIM_16B_SR_CC4OF_MASK                      TIM3_SR_CC4OF_MASK
#define TIM_16B_SR_CC4OF(x)                        TIM3_SR_CC4OF(x)

#define TIM_16B_SR_CC3OF_SHIFT                     TIM3_SR_CC3OF_SHIFT
#define TIM_16B_SR_CC3OF_MASK                      TIM3_SR_CC3OF_MASK
#define TIM_16B_SR_CC3OF(x)                        TIM3_SR_CC3OF(x)

#define TIM_16B_SR_CC2OF_SHIFT                     TIM3_SR_CC2OF_SHIFT
#define TIM_16B_SR_CC2OF_MASK                      TIM3_SR_CC2OF_MASK
#define TIM_16B_SR_CC2OF(x)                        TIM3_SR_CC2OF(x)

#define TIM_16B_SR_CC1OF_SHIFT                     TIM3_SR_CC1OF_SHIFT
#define TIM_16B_SR_CC1OF_MASK                      TIM3_SR_CC1OF_MASK
#define TIM_16B_SR_CC1OF(x)                        TIM3_SR_CC1OF(x)

#define TIM_16B_SR_TIF_SHIFT                       TIM3_SR_TIF_SHIFT
#define TIM_16B_SR_TIF_MASK                        TIM3_SR_TIF_MASK
#define TIM_16B_SR_TIF(x)                          TIM3_SR_TIF(x)

#define TIM_16B_SR_CC4IF_SHIFT                     TIM3_SR_CC4IF_SHIFT
#define TIM_16B_SR_CC4IF_MASK                      TIM3_SR_CC4IF_MASK
#define TIM_16B_SR_CC4IF(x)                        TIM3_SR_CC4IF(x)

#define TIM_16B_SR_CC3IF_SHIFT                     TIM3_SR_CC3IF_SHIFT
#define TIM_16B_SR_CC3IF_MASK                      TIM3_SR_CC3IF_MASK
#define TIM_16B_SR_CC3IF(x)                        TIM3_SR_CC3IF(x)

#define TIM_16B_SR_CC2IF_SHIFT                     TIM3_SR_CC2IF_SHIFT
#define TIM_16B_SR_CC2IF_MASK                      TIM3_SR_CC2IF_MASK
#define TIM_16B_SR_CC2IF(x)                        TIM3_SR_CC2IF(x)

#define TIM_16B_SR_CC1IF_SHIFT                     TIM3_SR_CC1IF_SHIFT
#define TIM_16B_SR_CC1IF_MASK                      TIM3_SR_CC1IF_MASK
#define TIM_16B_SR_CC1IF(x)                        TIM3_SR_CC1IF(x)

#define TIM_16B_SR_UIF_SHIFT                       TIM3_SR_UIF_SHIFT
#define TIM_16B_SR_UIF_MASK                        TIM3_SR_UIF_MASK
#define TIM_16B_SR_UIF(x)                          TIM3_SR_UIF(x)

/*!
 * @brief TIM_16B_EGR Register Bit Definition
 */

#define TIM_16B_EGR_TG_SHIFT                       TIM3_EGR_TG_SHIFT
#define TIM_16B_EGR_TG_MASK                        TIM3_EGR_TG_MASK
#define TIM_16B_EGR_TG(x)                          TIM3_EGR_TG(x)

#define TIM_16B_EGR_COMG_SHIFT                     TIM3_EGR_COMG_SHIFT
#define TIM_16B_EGR_COMG_MASK                      TIM3_EGR_COMG_MASK
#define TIM_16B_EGR_COMG(x)                        TIM3_EGR_COMG(x)

#define TIM_16B_EGR_CC4G_SHIFT                     TIM3_EGR_CC4G_SHIFT
#define TIM_16B_EGR_CC4G_MASK                      TIM3_EGR_CC4G_MASK
#define TIM_16B_EGR_CC4G(x)                        TIM3_EGR_CC4G(x)

#define TIM_16B_EGR_CC3G_SHIFT                     TIM3_EGR_CC3G_SHIFT
#define TIM_16B_EGR_CC3G_MASK                      TIM3_EGR_CC3G_MASK
#define TIM_16B_EGR_CC3G(x)                        TIM3_EGR_CC3G(x)

#define TIM_16B_EGR_CC2G_SHIFT                     TIM3_EGR_CC2G_SHIFT
#define TIM_16B_EGR_CC2G_MASK                      TIM3_EGR_CC2G_MASK
#define TIM_16B_EGR_CC2G(x)                        TIM3_EGR_CC2G(x)

#define TIM_16B_EGR_CC1G_SHIFT                     TIM3_EGR_CC1G_SHIFT
#define TIM_16B_EGR_CC1G_MASK                      TIM3_EGR_CC1G_MASK
#define TIM_16B_EGR_CC1G(x)                        TIM3_EGR_CC1G(x)

#define TIM_16B_EGR_UG_SHIFT                       TIM3_EGR_UG_SHIFT
#define TIM_16B_EGR_UG_MASK                        TIM3_EGR_UG_MASK
#define TIM_16B_EGR_UG(x)                          TIM3_EGR_UG(x)

/*!
 * @brief TIM_16B_CCMR1 Register Bit Definition
 */

#define TIM_16B_CCMR1_OC2CE_SHIFT                  TIM3_CCMR1_OC2CE_SHIFT
#define TIM_16B_CCMR1_OC2CE_MASK                   TIM3_CCMR1_OC2CE_MASK
#define TIM_16B_CCMR1_OC2CE(x)                     TIM3_CCMR1_OC2CE(x)

#define TIM_16B_CCMR1_OC2M_SHIFT                   TIM3_CCMR1_OC2M_SHIFT
#define TIM_16B_CCMR1_OC2M_MASK                    TIM3_CCMR1_OC2M_MASK
#define TIM_16B_CCMR1_OC2M(x)                      TIM3_CCMR1_OC2M(x)

#define TIM_16B_CCMR1_OC2PE_SHIFT                  TIM3_CCMR1_OC2PE_SHIFT
#define TIM_16B_CCMR1_OC2PE_MASK                   TIM3_CCMR1_OC2PE_MASK
#define TIM_16B_CCMR1_OC2PE(x)                     TIM3_CCMR1_OC2PE(x)

#define TIM_16B_CCMR1_OC2FE_SHIFT                  TIM3_CCMR1_OC2FE_SHIFT
#define TIM_16B_CCMR1_OC2FE_MASK                   TIM3_CCMR1_OC2FE_MASK
#define TIM_16B_CCMR1_OC2FE(x)                     TIM3_CCMR1_OC2FE(x)

#define TIM_16B_CCMR1_CC2S_SHIFT                   TIM3_CCMR1_CC2S_SHIFT
#define TIM_16B_CCMR1_CC2S_MASK                    TIM3_CCMR1_CC2S_MASK
#define TIM_16B_CCMR1_CC2S(x)                      TIM3_CCMR1_CC2S(x)

#define TIM_16B_CCMR1_OC1CE_SHIFT                  TIM3_CCMR1_OC1CE_SHIFT
#define TIM_16B_CCMR1_OC1CE_MASK                   TIM3_CCMR1_OC1CE_MASK
#define TIM_16B_CCMR1_OC1CE(x)                     TIM3_CCMR1_OC1CE(x)

