RT-Thread/rt-thread/bsp/mm32/libraries/MM32F3270_HAL/CMSIS/Device/MM32/MM32F3277/Include/mm32f3277g_features.h
#define TIM_32B_ARR_ARR_SHIFT                      TIM2_ARR_ARR_SHIFT
#define TIM_32B_ARR_ARR_MASK                       TIM2_ARR_ARR_MASK
#define TIM_32B_ARR_ARR(x)                         TIM2_ARR_ARR(x)

/*!
 * @brief TIM_32B_CCR1 Register Bit Definition
 */

#define TIM_32B_CCR1_CCR1_SHIFT                    TIM2_CCR1_CCR1_SHIFT
#define TIM_32B_CCR1_CCR1_MASK                     TIM2_CCR1_CCR1_MASK
#define TIM_32B_CCR1_CCR1(x)                       TIM2_CCR1_CCR1(x)

/*!
 * @brief TIM_32B_CCR2 Register Bit Definition
 */

#define TIM_32B_CCR2_CCR2_SHIFT                    TIM2_CCR2_CCR2_SHIFT
#define TIM_32B_CCR2_CCR2_MASK                     TIM2_CCR2_CCR2_MASK
#define TIM_32B_CCR2_CCR2(x)                       TIM2_CCR2_CCR2(x)

/*!
 * @brief TIM_32B_CCR3 Register Bit Definition
 */

#define TIM_32B_CCR3_CCR3_SHIFT                    TIM2_CCR3_CCR3_SHIFT
#define TIM_32B_CCR3_CCR3_MASK                     TIM2_CCR3_CCR3_MASK
#define TIM_32B_CCR3_CCR3(x)                       TIM2_CCR3_CCR3(x)

/*!
 * @brief TIM_32B_CCR4 Register Bit Definition
 */

#define TIM_32B_CCR4_CCR4_SHIFT                    TIM2_CCR4_CCR4_SHIFT
#define TIM_32B_CCR4_CCR4_MASK                     TIM2_CCR4_CCR4_MASK
#define TIM_32B_CCR4_CCR4(x)                       TIM2_CCR4_CCR4(x)

/*!
 * @brief TIM_32B_DCR Register Bit Definition
 */

#define TIM_32B_DCR_DBL_SHIFT                      TIM2_DCR_DBL_SHIFT
#define TIM_32B_DCR_DBL_MASK                       TIM2_DCR_DBL_MASK
#define TIM_32B_DCR_DBL(x)                         TIM2_DCR_DBL(x)

#define TIM_32B_DCR_DBA_SHIFT                      TIM2_DCR_DBA_SHIFT
#define TIM_32B_DCR_DBA_MASK                       TIM2_DCR_DBA_MASK
#define TIM_32B_DCR_DBA(x)                         TIM2_DCR_DBA(x)

/*!
 * @brief TIM_32B_DMAR Register Bit Definition
 */

#define TIM_32B_DMAR_DMAB_SHIFT                    TIM2_DMAR_DMAB_SHIFT
#define TIM_32B_DMAR_DMAB_MASK                     TIM2_DMAR_DMAB_MASK
#define TIM_32B_DMAR_DMAB(x)                       TIM2_DMAR_DMAB(x)

/*!
 * @brief TIM_32B_OR Register Bit Definition
 */

#define TIM_32B_OR_TI4RMP_SHIFT                    TIM2_OR_TI4RMP_SHIFT
#define TIM_32B_OR_TI4RMP_MASK                     TIM2_OR_TI4RMP_MASK
#define TIM_32B_OR_TI4RMP(x)                       TIM2_OR_TI4RMP(x)

#define TIM_32B_OR_ETRRMP_SHIFT                    TIM2_OR_ETRRMP_SHIFT
#define TIM_32B_OR_ETRRMP_MASK                     TIM2_OR_ETRRMP_MASK
#define TIM_32B_OR_ETRRMP(x)                       TIM2_OR_ETRRMP(x)

/*!
 * @}
 */ /* end of group TIM_32B_Register_Masks */

/*******************************************************************************
 * TIM6 Type
 ******************************************************************************/

/*!
 * @addtogroup TIM_BASIC_Register_Masks Register Masks
 * @{
 */

/*!
 * @brief TIM_BASIC_CR1 Register Bit Definition
 */

#define TIM_BASIC_CR1_APRE_SHIFT                     TIM6_CR1_APRE_SHIFT
#define TIM_BASIC_CR1_APRE_MASK                      TIM6_CR1_APRE_MASK
#define TIM_BASIC_CR1_APRE(x)                        TIM6_CR1_APRE(x)

#define TIM_BASIC_CR1_OPM_SHIFT                      TIM6_CR1_OPM_SHIFT
#define TIM_BASIC_CR1_OPM_MASK                       TIM6_CR1_OPM_MASK
#define TIM_BASIC_CR1_OPM(x)                         TIM6_CR1_OPM(x)

#define TIM_BASIC_CR1_URS_SHIFT                      TIM6_CR1_URS_SHIFT
#define TIM_BASIC_CR1_URS_MASK                       TIM6_CR1_URS_MASK
#define TIM_BASIC_CR1_URS(x)                         TIM6_CR1_URS(x)

#define TIM_BASIC_CR1_UDIS_SHIFT                     TIM6_CR1_UDIS_SHIFT
#define TIM_BASIC_CR1_UDIS_MASK                      TIM6_CR1_UDIS_MASK
#define TIM_BASIC_CR1_UDIS(x)                        TIM6_CR1_UDIS(x)

#define TIM_BASIC_CR1_CEN_SHIFT                      TIM6_CR1_CEN_SHIFT
#define TIM_BASIC_CR1_CEN_MASK                       TIM6_CR1_CEN_MASK
#define TIM_BASIC_CR1_CEN(x)                         TIM6_CR1_CEN(x)

/*!
 * @brief TIM_BASIC_DIER Register Bit Definition
 */

#define TIM_BASIC_DIER_UDE_SHIFT                     TIM6_DIER_UDE_SHIFT
#define TIM_BASIC_DIER_UDE_MASK                      TIM6_DIER_UDE_MASK
#define TIM_BASIC_DIER_UDE(x)                        TIM6_DIER_UDE(x)

#define TIM_BASIC_DIER_UIE_SHIFT                     TIM6_DIER_UIE_SHIFT
#define TIM_BASIC_DIER_UIE_MASK                      TIM6_DIER_UIE_MASK
#define TIM_BASIC_DIER_UIE(x)                        TIM6_DIER_UIE(x)

/*!
 * @brief TIM_BASIC_SR Register Bit Definition
 */

#define TIM_BASIC_SR_UIF_SHIFT                       TIM6_SR_UIF_SHIFT
#define TIM_BASIC_SR_UIF_MASK                        TIM6_SR_UIF_MASK
#define TIM_BASIC_SR_UIF(x)                          TIM6_SR_UIF(x)

/*!
 * @brief TIM_BASIC_EGR Register Bit Definition
 */

#define TIM_BASIC_EGR_UG_SHIFT                       TIM6_EGR_UG_SHIFT
#define TIM_BASIC_EGR_UG_MASK                        TIM6_EGR_UG_MASK
#define TIM_BASIC_EGR_UG(x)                          TIM6_EGR_UG(x)

/*!
 * @brief TIM_BASIC_CNT Register Bit Definition
 */

#define TIM_BASIC_CNT_CNT_SHIFT                      TIM6_CNT_CNT_SHIFT
#define TIM_BASIC_CNT_CNT_MASK                       TIM6_CNT_CNT_MASK
#define TIM_BASIC_CNT_CNT(x)                         TIM6_CNT_CNT(x)

/*!
 * @brief TIM_BASIC_PSC Register Bit Definition
 */

#define TIM_BASIC_PSC_PSC_SHIFT                      TIM6_PSC_PSC_SHIFT
#define TIM_BASIC_PSC_PSC_MASK                       TIM6_PSC_PSC_MASK
#define TIM_BASIC_PSC_PSC(x)                         TIM6_PSC_PSC(x)

/*!
 * @brief TIM_BASIC_ARR Register Bit Definition
 */

#define TIM_BASIC_ARR_ARR_SHIFT                      TIM6_ARR_ARR_SHIFT
#define TIM_BASIC_ARR_ARR_MASK                       TIM6_ARR_ARR_MASK
#define TIM_BASIC_ARR_ARR(x)                         TIM6_ARR_ARR(x)

/*!
 * @}
 */ /* end of group TIM_BASIC_Register_Masks */

 #endif /* __MM32F3277G_FEATURES_H__ */
